class script(object):
    START_TXT = """<b>Hᴇʟʟᴏ {},
ɪᴍ sɪᴍᴘʟᴇ ғɪʟᴇ sʜᴀʀᴇ ʙᴏᴛ</b>"""

    STATUS_TXT = """<b>★ Tᴏᴛᴀʟ Fɪʟᴇs: <code>{}</code>
★ Tᴏᴛᴀʟ Usᴇʀs: <code>{}</code>
★ Tᴏᴛᴀʟ Cʜᴀᴛs: <code>{}</code>
★ Usᴇᴅ Sᴛᴏʀᴀɢᴇ: <code>{}</code>
★ Fʀᴇᴇ Sᴛᴏʀᴀɢᴇ: <code>{}</code></b>"""

    LOG_TEXT_G = """#NewGroup
Gʀᴏᴜᴘ = {}(<code>{}</code>)
Tᴏᴛᴀʟ Mᴇᴍʙᴇʀs = <code>{}</code>
Aᴅᴅᴇᴅ Bʏ - {}"""

    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Nᴀᴍᴇ - {}"""

    ALRT_TXT = """मेरे दोस्त {}, ये किसी और की मूवी है तुम खुद मूवी मांगो 💁..."""

    OLD_ALRT_TXT = """ए दोस्त ई मैसेज पुराना हो गया है नया मांगो 🤣."""

    CUDNT_FND = """मुझे लगता है एस्पेलिंग गलत लिखे हो इनमे से मूवी का नाम चुनो"""

    I_CUDNT = """<b>अरे बकलोल सिर्फ मूवी का नाम लिखो नाम के आगे कुछ मत लिखो\n\nअगर मूवी का नाम नहीं लिखने आता तो नीचे बटन पर टैप कर के मूवी का नाम देखो 👇👇</b>"""

    I_CUD_NT = """ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏ ᴍᴏᴠɪᴇ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ {}.
ᴘʟᴇᴀꜱᴇ ᴄʜᴇᴄᴋ ᴛʜᴇ ꜱᴘᴇʟʟɪɴɢ ᴏɴ ɢᴏᴏɢʟᴇ ᴏʀ ɪᴍᴅʙ..."""

    MVE_NT_FND = """ई अभी मूवी नहीं है 🙅, कुछ दिन बाद आ सकती है..."""

    TOP_ALRT_MSG = """मूवी खोज रहे है 🔍..."""

    MELCOW_ENG = """<b>Hᴇʟʟᴏ {} 😍, Aɴᴅ Wᴇʟᴄᴏᴍᴇ Tᴏ {} Gʀᴏᴜᴘ ❤️</b>"""

    NORSLTS = """
#NoResult
★ Group Name <b>: {}</b>
★ Group Id <code>{}</code>
★User <b>: {}</b>

★ Message <code>{}</code>"""

    CAPTION = """
<b>📂 Fɪʟᴇ ɴᴀᴍᴇ : {file_name}</b>"""

    IMDB_TEMPLATE_TXT = """
<b>
🏷 Title: <a href={url}>{title}</a>
🎭 Genres: {genres}
📆 Year: <a href={url}/releaseinfo>{year}</a>
🌟 Rating: <a href={url}/ratings>{rating} / 10</a>
🔊 Language: {languages}</b> """
    
    
    RESTART_TXT = """
<b>Bᴏᴛ Rᴇsᴛᴀʀᴛᴇᴅ !

📅 Dᴀᴛᴇ : <code>{}</code>
⏰ Tɪᴍᴇ : <code>{}</code>
🌐 Tɪᴍᴇᴢᴏɴᴇ : <code>Asia/Kolkata</code>
🛠️ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: <code>v2.7.1 [ Sᴛᴀʙʟᴇ ]</code></b>"""

    LOGO = """
B̶O̶T̶ S̶U̶C̶C̶E̶S̶S̶F̶U̶L̶Y̶ S̶T̶A̶R̶T̶E̶D̶ 💖🏠👪💖💯💯💯💖🏠👪💖
"""